Autodesk.Revit.DB.Structure.LoadTypeBaseSet
A set that contains load type bases.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.Insert(Autodesk.Revit.DB.Structure.LoadTypeBase)
System.Int32
Insert the specified load type base into the set.
item: The load type base to be inserted into the set.
Returns: Returns whether the load type base was inserted into the set.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.ReverseIterator
Autodesk.Revit.DB.Structure.LoadTypeBaseSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.ForwardIterator
Autodesk.Revit.DB.Structure.LoadTypeBaseSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.Erase(Autodesk.Revit.DB.Structure.LoadTypeBase)
System.Int32
Removes a specified load type base from the set.
item: The load type base to be erased.
Returns: The number of load type bases that were erased from the set.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.Contains(Autodesk.Revit.DB.Structure.LoadTypeBase)
System.Boolean
Tests for the existence of a load type base within the set.
item: The load type base to be searched for.
Returns: The Contains method returns True if the load type base is within the set, otherwise False.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.Clear
void
Removes every load type base from the set, rendering it empty.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.Size
System.Int32
get
Returns the number of load type bases that are in the set.

Autodesk.Revit.DB.Structure.LoadTypeBaseSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.